#validator texts
required.denominator1=Mianownik 1 jest wymagany
required.denominator2=Mianownik 2 jest wymagany
denominator1.zero=Mianownik 1 musi by\u0107 ró\u017Cny od zera
denominator2.zero=Mianownik 2 musi by\u0107 ró\u017Cny od zera
number2.required=Druga liczba nie mo\u017Ce by\u0107 zerem

#page texts
totalDesc=liczba ca\u0142kowita
numeratorDesc=licznik
denominatorDesc=mianownik
decimalPowerDesc=wyk\u0142adnik dziesi\u0119tny
operationDesc=dzia\u0142anie
resultDesc=Wynik
sendButton=Oblicz
resetButton=Wyczy\u015B\u0107
approximate=wynik jest przybli\u017Cony!

home.page.title=Kalkulatory online.
home.page.text1=Kalkulatory online to strona, na której mo\u017Cna praktycznie wypróbowa\u0107 dzia\u0142anie klas z pakietu rssfiz.math dost\u0119pnego w serwisie:
home.page.text2=Pakiet ten zawiera klasy Java rozszerzaj\u0105ce pakiety matematyczne i zawieraj\u0105ce m.in. klasy u\u0142amków zwyk\u0142ych (Fraction, BigFraction) i liczb zespolonych (Complex). Kalkulatory poszczególnych typów dost\u0119pne s\u0105 poprzez odpowiednie linki w menu.
home.page.text3=Pakiet rssfiz.math mo\u017Cemy w prosty sposób zaimportowa\u0107 do dowolnego projektu Java o naturze maven, dodaj\u0105c poni\u017Csze parametry do pliku pom.xml 

fraction.page.title=Kalkulator u\u0142amków zwyk\u0142ych i liczb mieszanych.
fraction.page.text1=Kalkulator u\u0142amków zwyk\u0142ych oraz liczb mieszanych.<br>Wykorzystuje klas\u0119 Fraction z pakietu rssfiz.math dost\u0119pn\u0105 w serwisie: 
fraction.page.text2=Charakteryzuje si\u0119 wysok\u0105 precyzj\u0105 pod warunkiem, \u017Ce podczas oblicze\u0144 nie zostanie przekroczony rozmiar liczby typu Java&nbsp;long&nbsp;=&nbsp;(2^63), czyli&nbsp;\u00B1&nbsp;9223372036854775807.<br>W takim przypadku nast\u0105pi konwersja wyniku do liczby zmiennoprzecinkowej Java&nbsp;double i utrata precyzji. \u015Awiadczy\u0107 o tym b\u0119dzie ustawienie warto\u015Bci parametru uncertainty na&nbsp;-1&nbsp;(Fraction.UNKNOWN). Je\u015Bli wynik operacji jest dok\u0142adny, parametr uncertainty&nbsp;=&nbsp;0&nbsp;(Fraction.EXACTLY).
fraction.page.text3=Je\u015Bli jest potrzeba zachowania precyzji przy wykorzystaniu du\u017Cych liczb nale\u017Cy u\u017Cy\u0107 klasy BigFraction z tego samego pakietu. Umo\u017Cliwia ona wykonywanie oblicze\u0144 na liczbach z zakresu Java&nbsp;BigInteger,&nbsp;czyli&nbsp;2^500000000. Tutaj mo\u017Cna wypróbowa\u0107 kalkulator liczb 